tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-7;

boundaryField
{
    walls
    {
        type            compressible::epsilonWallFunction;
        value           uniform 1e-7;
    }
    wallFilm
    {
        type            compressible::epsilonWallFunction;
        value           uniform 1e-7;
    }
}


// ************************************************************************* //
